### Hello

In [37]:
from faker import Faker
import random
import numpy as np
import pandas as pd
fake = Faker()
fake.random.getstate()
fake.address()
fake.country()
fake.job()
fake.name()
fake.year()
#for i in range(10):
  #j=[fake.name()]
  #(j)
  #print(fake.address())
 # print(fake.country())
  #print(fake.job())
  #print(fake.random.getstate())
  #tt= pd.DataFrame(i)
#t=fake.date_time_between_dates(datetime_start=None, datetime_end=None)
#t

'2003'

In [38]:
df=[fake.name()for i in range (10)]
df1=[fake.country()for i in range (10)]
df2=[fake.year()for i in range (10)]
df3=[fake.job()for i in range (10)]
#tt= pd.DataFrame(np.random.randn(len(NAME)),index=NAME,columns=["FULLNAME"])
#tt= pd.DataFrame([j])
#tt= pd.DataFrame(df,df1,columns=["FULLNAME","FULLNAME1"])


#print(type(df))
df2

['1997',
 '1984',
 '1994',
 '1987',
 '2009',
 '2015',
 '1977',
 '1999',
 '1972',
 '2011']

In [24]:
tt= pd.DataFrame({"job":df3,"Year":df2,"NAMES":df,"COUNTRY":df1})

In [25]:
tt

,COUNTRY,NAMES,Year,job
0,Micronesia,Sergio Taylor,1991,Energy engineer
1,India,Victor Lopez,1998,Facilities manager
2,Bolivia,Tiffany Giles,1973,Comptroller
3,Guam,Diana Goodwin,2003,"Conservation officer, historic buildings"
4,Turkey,Amber Potts,2014,Warden/ranger
5,Faroe Islands,Alexa Yang,1991,Interpreter
6,Panama,Joshua Hopkins,1970,"Surveyor, building control"
7,Guyana,Bryan Black,1997,Art gallery manager
8,Barbados,Stephen Smith Jr.,2007,"Scientist, research (life sciences)"
9,Thailand,Colleen Hays,1998,Customer service manager

In [26]:
ss=tt.sample(3)

In [27]:
ss

    COUNTRY           NAMES  Year                         job
7    Guyana     Bryan Black  1997         Art gallery manager
9  Thailand    Colleen Hays  1998    Customer service manager
6    Panama  Joshua Hopkins  1970  Surveyor, building control